---
layout: post
toc: true
title: Amazon RDS
categories: [AP CSA]
courses: { csa: {week: 17} }
author: Arthur, Nikhil, Aditya
permalink: /period3/frq/database/sql
---

# SQLite

SQLite is a lightweight, serverless **database** stored in a single file. It follows SQL standards, and can be used in a variety of applications.

## Creating a New Table

```
CREATE TABLE table_name (
    column1 type, 
    column2 type, 
    column3 type
);
```
### Example data types in SQL:
```
VARCHAR
INTEGER
FLOAT
```
[More Example Types](https://www.geeksforgeeks.org/sql-data-types/)

## Deleting Tables

```
DROP TABLE <table name>;
```

## Populating Tables
```
INSERT INTO table_name
VALUES ('John', 92, A, 14)
```
## Modifying Entries
```
%%sql
UPDATE students
SET assignment_grade = 90.0
WHERE student_name = 'Tommy';
```

or
```
INSERT INTO table_name (name, score, grade, age)
VALUES ('John', 92, A, 14)
```

## Querying

### Selecting all rows from a table:
```
SELECT *
FROM table_name;
```

You can also specify specific columns to query as well by replacing the * with column names

```
SELECT name, (score-10) as late_score, age
FROM table_name;
```

More advanced queries can also be created:
```
SELECT *
FROM table_name
WHERE grade = 'A'
AND age = 14;
```

## Popcorn Hack: Write SQL Queries
Given the following table named `Employees`:

|EmpID   |Name   |Age     |Department|
|--------|-------|--------|----------|
|101     |Alice  |30      |HR        |
|102     |Bob    |25      |IT        |
|103     |Carol  |28      |Finance   |

Write SQL queries to:

1. Retrieve all employees working in the IT department.<br>
2. Add a new employee: `EmpID = 104, Name = Dave, Age = 26, Department = IT.`<br>
3. Delete the record of the employee named Carol.

In [2]:
%pip install --upgrade prettytable

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: prettytable in /home/nikhil/.local/lib/python3.10/site-packages (3.15.1)
Requirement already satisfied: wcwidth in /usr/lib/python3/dist-packages (from prettytable) (0.2.5)
Note: you may need to restart the kernel to use updated packages.

In [1]:
%pip install ipython-sql
import sqlite3

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in /home/nikhil/.local/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: six in /usr/lib/python3/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython in /usr/lib/python3/dist-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: sqlparse in /home/nikhil/.local/lib/python3.10/site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: ipython-genutils in /usr/lib/python3/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in /home/nikhil/.local/lib/python3.10/site-packages (from ipython-sql) (3.15.1)
Requirement already satisfied: sqlalchemy>=2.0 in /home/nikhil/.local/lib/python3.10/site-packages (from ipython-sql) (2.0.37)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/nikhil/.local/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /home/nikhil/.local/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: wcwidth in /usr/lib/python3/dist-packages (from prettytable->ipython-sql) (0.2.5)
Note: you may need to restart the kernel to use updated packages.

In [3]:
conn = sqlite3.connect('mydatabase.db')

In [4]:
%reload_ext sql

In [5]:
# Connect to the SQLite database
%sql sqlite:///mydatabase.db

%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%%sql
CREATE TABLE students (
    student_name VARCHAR,
    age INTEGER,
    assignment_grade FLOAT
);

 * sqlite:///mydatabase.db
(sqlite3.OperationalError) table students already exists
[SQL: CREATE TABLE students (
    student_name VARCHAR,
    age INTEGER,
    assignment_grade FLOAT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql
INSERT INTO students (student_name, age, assignment_grade) 
VALUES ('Tommy', 14, 85.5);

INSERT INTO students (student_name, age, assignment_grade) VALUES ('Emily', 15, 89.0);
INSERT INTO students (student_name, age, assignment_grade) VALUES ('Michael', 16, 91.0);
INSERT INTO students (student_name, age, assignment_grade) VALUES ('Sarah', 14, 87.5);
INSERT INTO students (student_name, age, assignment_grade) VALUES ('David', 15, 92.0);
INSERT INTO students (student_name, age, assignment_grade) VALUES ('Sophia', 16, 88.5);

 * sqlite:///mydatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
SELECT * FROM students

 * sqlite:///mydatabase.db
Done.

[('Tommy', 14, 85.5),
 ('Emily', 15, 89.0),
 ('Michael', 16, 91.0),
 ('Sarah', 14, 87.5),
 ('David', 15, 92.0),
 ('Sophia', 16, 88.5),
 ('Tommy', 14, 85.5),
 ('Emily', 15, 89.0),
 ('Michael', 16, 91.0),
 ('Sarah', 14, 87.5),
 ('David', 15, 92.0),
 ('Sophia', 16, 88.5)]

## Popcorn/Homework Hack:
Period 3 CSA was very good and the substitute teacher left a very positive note. Because of this Mr. Mortensen has decided to give all of his students a 10% increase on their assignment grade. 

Create an SQL query that returns a table with the Student names and a new collumn called bonus_score which has the assignment_grade with the added 10% bonus. 
Hint: use advanced query methods.

In [ ]:
%%sql
-- Your Query Here:

## Joins:

Joins are a way to combine data from multiple tables.
![Image](https://github.com/user-attachments/assets/7046bf4d-0f7c-41f0-b9a2-57fdf4c1cd22)

In [9]:
%%sql
CREATE TABLE student_grades (
    student_name VARCHAR,
    letter_grade CHAR(1)
);

INSERT INTO student_grades (student_name, letter_grade) VALUES ('Tommy', 'B');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('Emily', 'B+');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('Michael', 'A-');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('Sarah', 'B');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('David', 'A');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('Sophia', 'B+');
INSERT INTO student_grades (student_name, letter_grade) VALUES ('Jimmy', 'B+');

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

inner join:

In [ ]:
%%sql
SELECT students.student_name, students.age, students.assignment_grade, student_grades.letter_grade
FROM students
JOIN student_grades
ON students.student_name = student_grades.student_name;

## PBL Example

![Image](https://github.com/user-attachments/assets/66537ef0-2b36-4f8c-8723-8f57defd2a18)

Spring JPA automates the process of creating SQL querys through a set naming convention. The same outcome could be achieved with the query seen below.

In [ ]:
%%sql
SELECT * 
FROM students 
WHERE student_name = 'John';